Autodesk.Revit.UI.FedRampSupportService.CheckFedRampEnvironment(System.Boolean)
Checks whether the current Revit process is running in FedRAMP environment.
toShowFeatureNotAvailable:
To show a standard error message indicating featureas are not available in RedRAMP environment.
Since:
2024

Autodesk.Revit.UI.FedRampSupportService.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.FedRampSupportService
UI service guarding accesses to cloud features in FedRAMP environment.
Since:
2024